# macOS dev environment dependencies
# Install everything with: brew bundle

# ── Terminal & Shell ──────────────────────────────────────────────────────────
brew "alacritty"
brew "findutils"          # provides gfind (used by bootstrap.sh)
brew "tmux"
brew "fzf"                # fuzzy finder (used heavily in .zshrc)

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-fira-code"

# ── CLI Tools ─────────────────────────────────────────────────────────────────
brew "ripgrep"            # rg - fast grep
brew "fd"                 # fast find (fdfind in .zshrc)
brew "bat"                # better cat (used in fzf previews)
brew "eza"                # better ls (successor to exa)
brew "tree"               # directory tree
brew "neofetch"           # system info (startup banner)
brew "gh"                 # GitHub CLI
brew "git"

# ── Editors & AI ──────────────────────────────────────────────────────────────
brew "neovim"
brew "claude-code"

# ── Languages & Runtimes ──────────────────────────────────────────────────────
brew "rust"
brew "node"
brew "yarn"
brew "rbenv"              # Ruby version manager
brew "ruby-build"         # rbenv plugin
